pub mod *活用* {
    pub mod *カ変・クル* {
        define_enum! {
            pub enum #カ変・クル# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
                "命令ｉ" => #命令ｉ#,
                "仮定縮約１" => #仮定縮約１#,
                "体言接続特殊" => #体言接続特殊#,
                "体言接続特殊２" => #体言接続特殊２#,
            }
        }
    }
    pub use self::*カ変・クル*::#カ変・クル#;

    pub mod *カ変・来ル* {
        define_enum! {
            pub enum #カ変・来ル# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
                "命令ｉ" => #命令ｉ#,
                "仮定縮約１" => #仮定縮約１#,
                "体言接続特殊" => #体言接続特殊#,
                "体言接続特殊２" => #体言接続特殊２#,
            }
        }
    }
    pub use self::*カ変・来ル*::#カ変・来ル#;

    pub mod *サ変・スル* {
        define_enum! {
            pub enum #サ変・スル# features[5] {
                "基本形" => #基本形#,
                "文語基本形" => #文語基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "未然ウ接続" => #未然ウ接続#,
                "未然レル接続" => #未然レル接続#,
                "未然ヌ接続" => #未然ヌ接続#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
                "命令ｒｏ" => #命令ｒｏ#,
                "命令ｉ" => #命令ｉ#,
                "仮定縮約１" => #仮定縮約１#,
                "体言接続特殊" => #体言接続特殊#,
                "体言接続特殊２" => #体言接続特殊２#,
            }
        }
    }
    pub use self::*サ変・スル*::#サ変・スル#;

    pub mod *サ変・－スル* {
        define_enum! {
            pub enum #サ変・－スル# features[5] {
                "基本形" => #基本形#,
                "文語基本形" => #文語基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "未然ウ接続" => #未然ウ接続#,
                "未然レル接続" => #未然レル接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
                "命令ｒｏ" => #命令ｒｏ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*サ変・－スル*::#サ変・－スル#;

    pub mod *サ変・－ズル* {
        define_enum! {
            pub enum #サ変・－ズル# features[5] {
                "基本形" => #基本形#,
                "文語基本形" => #文語基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*サ変・－ズル*::#サ変・－ズル#;

    pub mod *一段* {
        define_enum! {
            pub enum #一段# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
                "命令ｒｏ" => #命令ｒｏ#,
                "仮定縮約１" => #仮定縮約１#,
                "体言接続特殊" => #体言接続特殊#,
            }
        }
    }
    pub use self::*一段*::#一段#;

    pub mod *一段・病メル* {
        define_enum! {
            pub enum #一段・病メル# features[5] {
                "基本形" => #基本形#,
            }
        }
    }
    pub use self::*一段・病メル*::#一段・病メル#;

    pub mod *五段・カ行イ音便* {
        define_enum! {
            pub enum #五段・カ行イ音便# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・カ行イ音便*::#五段・カ行イ音便#;

    pub mod *五段・カ行促音便* {
        define_enum! {
            pub enum #五段・カ行促音便# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・カ行促音便*::#五段・カ行促音便#;

    pub mod *五段・カ行促音便ユク* {
        define_enum! {
            pub enum #五段・カ行促音便ユク# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・カ行促音便ユク*::#五段・カ行促音便ユク#;

    pub mod *五段・ガ行* {
        define_enum! {
            pub enum #五段・ガ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・ガ行*::#五段・ガ行#;

    pub mod *五段・サ行* {
        define_enum! {
            pub enum #五段・サ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・サ行*::#五段・サ行#;

    pub mod *五段・タ行* {
        define_enum! {
            pub enum #五段・タ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・タ行*::#五段・タ行#;

    pub mod *五段・ナ行* {
        define_enum! {
            pub enum #五段・ナ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・ナ行*::#五段・ナ行#;

    pub mod *五段・バ行* {
        define_enum! {
            pub enum #五段・バ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・バ行*::#五段・バ行#;

    pub mod *五段・マ行* {
        define_enum! {
            pub enum #五段・マ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・マ行*::#五段・マ行#;

    pub mod *五段・ラ行* {
        define_enum! {
            pub enum #五段・ラ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然特殊" => #未然特殊#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
                "体言接続特殊" => #体言接続特殊#,
                "体言接続特殊２" => #体言接続特殊２#,
            }
        }
    }
    pub use self::*五段・ラ行*::#五段・ラ行#;

    pub mod *五段・ラ行アル* {
        define_enum! {
            pub enum #五段・ラ行アル# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
                "体言接続特殊" => #体言接続特殊#,
            }
        }
    }
    pub use self::*五段・ラ行アル*::#五段・ラ行アル#;

    pub mod *五段・ラ行特殊* {
        define_enum! {
            pub enum #五段・ラ行特殊# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然特殊" => #未然特殊#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "命令ｉ" => #命令ｉ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*五段・ラ行特殊*::#五段・ラ行特殊#;

    pub mod *五段・ワ行ウ音便* {
        define_enum! {
            pub enum #五段・ワ行ウ音便# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*五段・ワ行ウ音便*::#五段・ワ行ウ音便#;

    pub mod *五段・ワ行促音便* {
        define_enum! {
            pub enum #五段・ワ行促音便# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*五段・ワ行促音便*::#五段・ワ行促音便#;

    pub mod *四段・カ行* {
        define_enum! {
            pub enum #四段・カ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*四段・カ行*::#四段・カ行#;

    pub mod *四段・ガ行* {
        define_enum! {
            pub enum #四段・ガ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*四段・ガ行*::#四段・ガ行#;

    pub mod *四段・サ行* {
        define_enum! {
            pub enum #四段・サ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*四段・サ行*::#四段・サ行#;

    pub mod *四段・タ行* {
        define_enum! {
            pub enum #四段・タ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*四段・タ行*::#四段・タ行#;

    pub mod *四段・バ行* {
        define_enum! {
            pub enum #四段・バ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*四段・バ行*::#四段・バ行#;

    pub mod *四段・マ行* {
        define_enum! {
            pub enum #四段・マ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*四段・マ行*::#四段・マ行#;

    pub mod *四段・ラ行* {
        define_enum! {
            pub enum #四段・ラ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*四段・ラ行*::#四段・ラ行#;

    pub mod *四段・ハ行* {
        define_enum! {
            pub enum #四段・ハ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*四段・ハ行*::#四段・ハ行#;

    pub mod *ラ変* {
        define_enum! {
            pub enum #ラ変# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*ラ変*::#ラ変#;

    pub mod *上二・ダ行* {
        define_enum! {
            pub enum #上二・ダ行# features[5] {
                "基本形" => #基本形#,
                "現代基本形" => #現代基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*上二・ダ行*::#上二・ダ行#;

    pub mod *上二・ハ行* {
        define_enum! {
            pub enum #上二・ハ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*上二・ハ行*::#上二・ハ行#;

    pub mod *下二・ア行* {
        define_enum! {
            pub enum #下二・ア行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・ア行*::#下二・ア行#;

    pub mod *下二・カ行* {
        define_enum! {
            pub enum #下二・カ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・カ行*::#下二・カ行#;

    pub mod *下二・ガ行* {
        define_enum! {
            pub enum #下二・ガ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・ガ行*::#下二・ガ行#;

    pub mod *下二・サ行* {
        define_enum! {
            pub enum #下二・サ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・サ行*::#下二・サ行#;

    pub mod *下二・ザ行* {
        define_enum! {
            pub enum #下二・ザ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・ザ行*::#下二・ザ行#;

    pub mod *下二・タ行* {
        define_enum! {
            pub enum #下二・タ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・タ行*::#下二・タ行#;

    pub mod *下二・ダ行* {
        define_enum! {
            pub enum #下二・ダ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・ダ行*::#下二・ダ行#;

    pub mod *下二・ナ行* {
        define_enum! {
            pub enum #下二・ナ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・ナ行*::#下二・ナ行#;

    pub mod *下二・ハ行* {
        define_enum! {
            pub enum #下二・ハ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・ハ行*::#下二・ハ行#;

    pub mod *下二・バ行* {
        define_enum! {
            pub enum #下二・バ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・バ行*::#下二・バ行#;

    pub mod *下二・マ行* {
        define_enum! {
            pub enum #下二・マ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・マ行*::#下二・マ行#;

    pub mod *下二・ヤ行* {
        define_enum! {
            pub enum #下二・ヤ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・ヤ行*::#下二・ヤ行#;

    pub mod *下二・ラ行* {
        define_enum! {
            pub enum #下二・ラ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・ラ行*::#下二・ラ行#;

    pub mod *下二・ワ行* {
        define_enum! {
            pub enum #下二・ワ行# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・ワ行*::#下二・ワ行#;

    pub mod *下二・得* {
        define_enum! {
            pub enum #下二・得# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*下二・得*::#下二・得#;

    pub mod *一段・クレル* {
        define_enum! {
            pub enum #一段・クレル# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然特殊" => #未然特殊#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "命令ｙｏ" => #命令ｙｏ#,
                "命令ｒｏ" => #命令ｒｏ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*一段・クレル*::#一段・クレル#;

    pub mod *一段・ル* {
        define_enum! {
            pub enum #一段・ル# features[5] {
                "基本形" => #基本形#,
                "仮定形" => #仮定形#,
                "命令ｒｏ" => #命令ｒｏ#,
                "仮定縮約１" => #仮定縮約１#,
            }
        }
    }
    pub use self::*一段・ル*::#一段・ル#;

    pub mod *形容詞・アウオ段* {
        define_enum! {
            pub enum #形容詞・アウオ段# features[5] {
                "基本形" => #基本形#,
                "文語基本形" => #文語基本形#,
                "未然ヌ接続" => #未然ヌ接続#,
                "未然ウ接続" => #未然ウ接続#,
                "連用タ接続" => #連用タ接続#,
                "連用テ接続" => #連用テ接続#,
                "連用テ接続" => #連用テ接続#,
                "連用ゴザイ接続" => #連用ゴザイ接続#,
                "連用ゴザイ接続" => #連用ゴザイ接続#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
                "仮定縮約２" => #仮定縮約２#,
                "ガル接続" => #ガル接続#,
            }
        }
    }
    pub use self::*形容詞・アウオ段*::#形容詞・アウオ段#;

    pub mod *形容詞・イ段* {
        define_enum! {
            pub enum #形容詞・イ段# features[5] {
                "基本形" => #基本形#,
                "文語基本形" => #文語基本形#,
                "未然ヌ接続" => #未然ヌ接続#,
                "未然ウ接続" => #未然ウ接続#,
                "連用タ接続" => #連用タ接続#,
                "連用テ接続" => #連用テ接続#,
                "連用テ接続" => #連用テ接続#,
                "連用ゴザイ接続" => #連用ゴザイ接続#,
                "連用ゴザイ接続" => #連用ゴザイ接続#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
                "仮定縮約２" => #仮定縮約２#,
                "ガル接続" => #ガル接続#,
            }
        }
    }
    pub use self::*形容詞・イ段*::#形容詞・イ段#;

    pub mod *特殊・ナイ* {
        define_enum! {
            pub enum #特殊・ナイ# features[5] {
                "基本形" => #基本形#,
                "音便基本形" => #音便基本形#,
                "音便基本形" => #音便基本形#,
                "文語基本形" => #文語基本形#,
                "未然ヌ接続" => #未然ヌ接続#,
                "未然ウ接続" => #未然ウ接続#,
                "連用タ接続" => #連用タ接続#,
                "連用タ接続" => #連用タ接続#,
                "連用テ接続" => #連用テ接続#,
                "連用テ接続" => #連用テ接続#,
                "連用デ接続" => #連用デ接続#,
                "連用ゴザイ接続" => #連用ゴザイ接続#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "仮定縮約１" => #仮定縮約１#,
                "仮定縮約２" => #仮定縮約２#,
                "ガル接続" => #ガル接続#,
            }
        }
    }
    pub use self::*特殊・ナイ*::#特殊・ナイ#;

    pub mod *特殊・タイ* {
        define_enum! {
            pub enum #特殊・タイ# features[5] {
                "基本形" => #基本形#,
                "音便基本形" => #音便基本形#,
                "音便基本形" => #音便基本形#,
                "文語基本形" => #文語基本形#,
                "未然ヌ接続" => #未然ヌ接続#,
                "未然ウ接続" => #未然ウ接続#,
                "連用タ接続" => #連用タ接続#,
                "連用タ接続" => #連用タ接続#,
                "連用テ接続" => #連用テ接続#,
                "連用テ接続" => #連用テ接続#,
                "連用ゴザイ接続" => #連用ゴザイ接続#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "仮定縮約１" => #仮定縮約１#,
                "仮定縮約２" => #仮定縮約２#,
                "ガル接続" => #ガル接続#,
            }
        }
    }
    pub use self::*特殊・タイ*::#特殊・タイ#;

    pub mod *特殊・タ* {
        define_enum! {
            pub enum #特殊・タ# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "仮定形" => #仮定形#,
            }
        }
    }
    pub use self::*特殊・タ*::#特殊・タ#;

    pub mod *特殊・ダ* {
        define_enum! {
            pub enum #特殊・ダ# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "連用タ接続" => #連用タ接続#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*特殊・ダ*::#特殊・ダ#;

    pub mod *特殊・デス* {
        define_enum! {
            pub enum #特殊・デス# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
            }
        }
    }
    pub use self::*特殊・デス*::#特殊・デス#;

    pub mod *特殊・ジャ* {
        define_enum! {
            pub enum #特殊・ジャ# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
            }
        }
    }
    pub use self::*特殊・ジャ*::#特殊・ジャ#;

    pub mod *特殊・マス* {
        define_enum! {
            pub enum #特殊・マス# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "未然ウ接続" => #未然ウ接続#,
                "連用形" => #連用形#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "命令ｉ" => #命令ｉ#,
            }
        }
    }
    pub use self::*特殊・マス*::#特殊・マス#;

    pub mod *特殊・ヌ* {
        define_enum! {
            pub enum #特殊・ヌ# features[5] {
                "基本形" => #基本形#,
                "文語基本形" => #文語基本形#,
                "連用形" => #連用形#,
                "連用ニ接続" => #連用ニ接続#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "仮定形" => #仮定形#,
                "仮定形" => #仮定形#,
            }
        }
    }
    pub use self::*特殊・ヌ*::#特殊・ヌ#;

    pub mod *文語・ベシ* {
        define_enum! {
            pub enum #文語・ベシ# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
            }
        }
    }
    pub use self::*文語・ベシ*::#文語・ベシ#;

    pub mod *文語・ゴトシ* {
        define_enum! {
            pub enum #文語・ゴトシ# features[5] {
                "基本形" => #基本形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
            }
        }
    }
    pub use self::*文語・ゴトシ*::#文語・ゴトシ#;

    pub mod *文語・ナリ* {
        define_enum! {
            pub enum #文語・ナリ# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*文語・ナリ*::#文語・ナリ#;

    pub mod *文語・マジ* {
        define_enum! {
            pub enum #文語・マジ# features[5] {
                "基本形" => #基本形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
            }
        }
    }
    pub use self::*文語・マジ*::#文語・マジ#;

    pub mod *文語・シム* {
        define_enum! {
            pub enum #文語・シム# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*文語・シム*::#文語・シム#;

    pub mod *文語・キ* {
        define_enum! {
            pub enum #文語・キ# features[5] {
                "基本形" => #基本形#,
                "体言接続" => #体言接続#,
                "命令ｅ" => #命令ｅ#,
            }
        }
    }
    pub use self::*文語・キ*::#文語・キ#;

    pub mod *文語・ケリ* {
        define_enum! {
            pub enum #文語・ケリ# features[5] {
                "基本形" => #基本形#,
                "体言接続" => #体言接続#,
            }
        }
    }
    pub use self::*文語・ケリ*::#文語・ケリ#;

    pub mod *文語・リ* {
        define_enum! {
            pub enum #文語・リ# features[5] {
                "基本形" => #基本形#,
                "体言接続" => #体言接続#,
            }
        }
    }
    pub use self::*文語・リ*::#文語・リ#;

    pub mod *文語・ル* {
        define_enum! {
            pub enum #文語・ル# features[5] {
                "基本形" => #基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
                "体言接続" => #体言接続#,
                "仮定形" => #仮定形#,
                "命令ｅ" => #命令ｅ#,
                "命令ｙｏ" => #命令ｙｏ#,
            }
        }
    }
    pub use self::*文語・ル*::#文語・ル#;

    pub mod *不変化型* {
        define_enum! {
            pub enum #不変化型# features[5] {
                "基本形" => #基本形#,
            }
        }
    }
    pub use self::*不変化型*::#不変化型#;

    pub mod *形容詞・イイ* {
        define_enum! {
            pub enum #形容詞・イイ# features[5] {
                "基本形" => #基本形#,
                "基本形-促音便" => #基本形-促音便#,
                "基本形-促音便" => #基本形-促音便#,
            }
        }
    }
    pub use self::*形容詞・イイ*::#形容詞・イイ#;

    pub mod *特殊・ドス* {
        define_enum! {
            pub enum #特殊・ドス# features[5] {
                "基本形" => #基本形#,
            }
        }
    }
    pub use self::*特殊・ドス*::#特殊・ドス#;

    pub mod *一段・得ル* {
        define_enum! {
            pub enum #一段・得ル# features[5] {
                "基本形" => #基本形#,
                "仮定形" => #仮定形#,
            }
        }
    }
    pub use self::*一段・得ル*::#一段・得ル#;

    pub mod *特殊・ヤ* {
        define_enum! {
            pub enum #特殊・ヤ# features[5] {
                "(基本形" => #(基本形#,
                "未然形" => #未然形#,
                "連用形" => #連用形#,
            }
        }
    }
    pub use self::*特殊・ヤ*::#特殊・ヤ#;

    define_enum! {
        pub enum #活用# features[4] {
            "カ変・クル" => #カ変・クル#(..),
            "カ変・来ル" => #カ変・来ル#(..),
            "サ変・スル" => #サ変・スル#(..),
            "サ変・－スル" => #サ変・－スル#(..),
            "サ変・－ズル" => #サ変・－ズル#(..),
            "一段" => #一段#(..),
            "一段・病メル" => #一段・病メル#(..),
            "五段・カ行イ音便" => #五段・カ行イ音便#(..),
            "五段・カ行促音便" => #五段・カ行促音便#(..),
            "五段・カ行促音便ユク" => #五段・カ行促音便ユク#(..),
            "五段・ガ行" => #五段・ガ行#(..),
            "五段・サ行" => #五段・サ行#(..),
            "五段・タ行" => #五段・タ行#(..),
            "五段・ナ行" => #五段・ナ行#(..),
            "五段・バ行" => #五段・バ行#(..),
            "五段・マ行" => #五段・マ行#(..),
            "五段・ラ行" => #五段・ラ行#(..),
            "五段・ラ行アル" => #五段・ラ行アル#(..),
            "五段・ラ行特殊" => #五段・ラ行特殊#(..),
            "五段・ワ行ウ音便" => #五段・ワ行ウ音便#(..),
            "五段・ワ行促音便" => #五段・ワ行促音便#(..),
            "四段・カ行" => #四段・カ行#(..),
            "四段・ガ行" => #四段・ガ行#(..),
            "四段・サ行" => #四段・サ行#(..),
            "四段・タ行" => #四段・タ行#(..),
            "四段・バ行" => #四段・バ行#(..),
            "四段・マ行" => #四段・マ行#(..),
            "四段・ラ行" => #四段・ラ行#(..),
            "四段・ハ行" => #四段・ハ行#(..),
            "ラ変" => #ラ変#(..),
            "上二・ダ行" => #上二・ダ行#(..),
            "上二・ハ行" => #上二・ハ行#(..),
            "下二・ア行" => #下二・ア行#(..),
            "下二・カ行" => #下二・カ行#(..),
            "下二・ガ行" => #下二・ガ行#(..),
            "下二・サ行" => #下二・サ行#(..),
            "下二・ザ行" => #下二・ザ行#(..),
            "下二・タ行" => #下二・タ行#(..),
            "下二・ダ行" => #下二・ダ行#(..),
            "下二・ナ行" => #下二・ナ行#(..),
            "下二・ハ行" => #下二・ハ行#(..),
            "下二・バ行" => #下二・バ行#(..),
            "下二・マ行" => #下二・マ行#(..),
            "下二・ヤ行" => #下二・ヤ行#(..),
            "下二・ラ行" => #下二・ラ行#(..),
            "下二・ワ行" => #下二・ワ行#(..),
            "下二・得" => #下二・得#(..),
            "一段・クレル" => #一段・クレル#(..),
            "一段・ル" => #一段・ル#(..),
            "形容詞・アウオ段" => #形容詞・アウオ段#(..),
            "形容詞・イ段" => #形容詞・イ段#(..),
            "特殊・ナイ" => #特殊・ナイ#(..),
            "特殊・タイ" => #特殊・タイ#(..),
            "特殊・タ" => #特殊・タ#(..),
            "特殊・ダ" => #特殊・ダ#(..),
            "特殊・デス" => #特殊・デス#(..),
            "特殊・ジャ" => #特殊・ジャ#(..),
            "特殊・マス" => #特殊・マス#(..),
            "特殊・ヌ" => #特殊・ヌ#(..),
            "文語・ベシ" => #文語・ベシ#(..),
            "文語・ゴトシ" => #文語・ゴトシ#(..),
            "文語・ナリ" => #文語・ナリ#(..),
            "文語・マジ" => #文語・マジ#(..),
            "文語・シム" => #文語・シム#(..),
            "文語・キ" => #文語・キ#(..),
            "文語・ケリ" => #文語・ケリ#(..),
            "文語・リ" => #文語・リ#(..),
            "文語・ル" => #文語・ル#(..),
            "不変化型" => #不変化型#(..),
            "形容詞・イイ" => #形容詞・イイ#(..),
            "特殊・ドス" => #特殊・ドス#(..),
            "一段・得ル" => #一段・得ル#(..),
            "特殊・ヤ" => #特殊・ヤ#(..),
        }
    }
}
pub use self::*活用*::#活用#;

