
(活用
(カ変・クル
  (基本形)
   (未然形)
   (未然ウ接続)
   (連用形)
   (仮定形)
   (命令ｙｏ)
   (命令ｉ)
   (仮定縮約１)
   (体言接続特殊)
   (体言接続特殊２))

(カ変・来ル
  (基本形)
   (未然形)
   (未然ウ接続)
   (連用形)
   (仮定形)
   (命令ｙｏ)
   (命令ｉ)
   (仮定縮約１)
   (体言接続特殊)
   (体言接続特殊２))

(サ変・スル
  (基本形)
   (文語基本形)
   (未然形)
   (未然ウ接続)
   (未然ウ接続)
   (未然レル接続)
   (未然ヌ接続)
   (連用形)
   (仮定形)
   (命令ｙｏ)
   (命令ｒｏ)
   (命令ｉ)
   (仮定縮約１)
   (体言接続特殊)
   (体言接続特殊２))

(サ変・−スル
        (基本形)
        (文語基本形)
        (未然形)
        (未然ウ接続)
        (未然ウ接続)
        (未然レル接続)
        (仮定形)
        (命令ｙｏ)
        (命令ｒｏ)
        (仮定縮約１)
)

(サ変・−ズル
        (基本形)
        (文語基本形)
        (未然形)
        (未然ウ接続)
        (仮定形)
        (命令ｙｏ)
        (仮定縮約１)
)

(一段
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (仮定形)
        (命令ｙｏ)
        (命令ｒｏ)
        (仮定縮約１)
        (体言接続特殊)
)

(一段・病メル
        (基本形)
)

(五段・カ行イ音便
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
)

(五段・カ行促音便
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
)

(五段・カ行促音便ユク
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
)

(五段・ガ行
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
)

(五段・サ行
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
)

(五段・タ行
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
)

(五段・ナ行
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
)

(五段・バ行
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
)

(五段・マ行
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
)

(五段・ラ行
        (基本形)
        (未然形)
        (未然特殊)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
        (体言接続特殊)
        (体言接続特殊２)	
)

(五段・ラ行アル
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
        (体言接続特殊)
)

(五段・ラ行特殊
        (基本形)
        (未然形)
        (未然特殊)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
        (命令ｉ)
        (仮定縮約１)
)

(五段・ワ行ウ音便
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
)

(五段・ワ行促音便
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (連用タ接続)
        (仮定形)
        (命令ｅ)
)

(四段・カ行
        (基本形)
        (未然形)
        (連用形)
        (仮定形)
        (命令ｅ)
)

(四段・ガ行
        (基本形)
        (未然形)
        (連用形)
        (仮定形)
        (命令ｅ)
)

(四段・サ行
        (基本形)
        (未然形)
        (連用形)
        (仮定形)
        (命令ｅ)
)

(四段・タ行
        (基本形)
        (未然形)
        (連用形)
        (仮定形)
        (命令ｅ)
)

(四段・バ行
        (基本形)
        (未然形)
        (連用形)
        (仮定形)
        (命令ｅ)
)

(四段・マ行
        (基本形)
        (未然形)
        (連用形)
        (仮定形)
        (命令ｅ)
)

(四段・ラ行
        (基本形)
        (未然形)
        (連用形)
        (仮定形)
        (命令ｅ)
)

(四段・ハ行
        (基本形)
        (未然形)
        (連用形)
        (仮定形)
        (命令ｅ)
)

(ラ変
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｅ)
)

(上二・ダ行
        (基本形)
        (現代基本形)
        (未然形)
        (連用形)
        (体言接続)
        (体言接続)
        (仮定形)
        (仮定形)
        (命令ｙｏ)
)

(上二・ハ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・ア行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・カ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・ガ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・サ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・ザ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・タ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・ダ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・ナ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・ハ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・バ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・マ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・ヤ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・ラ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・ワ行
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)

(下二・得
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｙｏ)
)


(一段・クレル
        (基本形)
        (未然形)
        (未然特殊)
        (未然ウ接続)
        (連用形)
        (仮定形)
        (命令ｅ)
        (命令ｙｏ)
        (命令ｒｏ)
        (仮定縮約１)
)

(一段・ル
        (基本形)
        (仮定形)
        (命令ｒｏ)
        (仮定縮約１)
)


(形容詞・アウオ段
        (基本形)
        (文語基本形)
        (未然ヌ接続)
        (未然ウ接続)
        (連用タ接続)
        (連用テ接続)
        (連用テ接続)
        (連用ゴザイ接続)
        (連用ゴザイ接続)
        (体言接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
        (仮定縮約２)
        (ガル接続)
)

(形容詞・イ段
        (基本形)
        (文語基本形)
        (未然ヌ接続)
        (未然ウ接続)
        (連用タ接続)
        (連用テ接続)
        (連用テ接続)
        (連用ゴザイ接続)
        (連用ゴザイ接続)
        (体言接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
        (仮定縮約２)
        (ガル接続)
)


(特殊・ナイ
        (基本形)
        (音便基本形)
        (音便基本形)
        (文語基本形)
        (未然ヌ接続)
        (未然ウ接続)
        (連用タ接続)
        (連用タ接続)
        (連用テ接続)
        (連用テ接続)
        (連用デ接続)
        (連用ゴザイ接続)
        (体言接続)
        (仮定形)
        (命令ｅ)
        (仮定縮約１)
        (仮定縮約２)
        (ガル接続)
)

(特殊・タイ
        (基本形)
        (音便基本形)
        (音便基本形)
        (文語基本形)
        (未然ヌ接続)
        (未然ウ接続)
        (連用タ接続)
        (連用タ接続)
        (連用テ接続)
        (連用テ接続)
        (連用ゴザイ接続)
        (体言接続)
        (仮定形)
        (仮定縮約１)
        (仮定縮約２)
        (ガル接続)
)

(特殊・タ
        (基本形)
        (未然形)
        (仮定形)
)

(特殊・ダ
        (基本形)
        (未然形)
        (未然形)
        (連用形)
        (連用タ接続)

        (体言接続)
        (仮定形)
        (命令ｅ)
)

(特殊・デス
        (基本形)
        (未然形)
        (連用形)
)

(特殊・ジャ
        (基本形)
        (未然形)
        (連用形)
)

(特殊・マス
        (基本形)
        (未然形)
        (未然ウ接続)
        (連用形)
        (仮定形)
        (命令ｅ)
        (命令ｉ)
)

(特殊・ヌ
        (基本形)
        (文語基本形)
        (連用形)
        (連用ニ接続)
        (体言接続)
        (仮定形)
        (仮定形)
        (仮定形)
)

(文語・ベシ
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
)

(文語・ゴトシ
        (基本形)
        (連用形)
        (体言接続)
)

(文語・ナリ
        (基本形)
        (未然形)
        (体言接続)
        (仮定形)
        (命令ｅ)
)

(文語・マジ
        (基本形)
        (連用形)
        (体言接続)
        (仮定形)
)

(文語・シム
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｅ)
        (命令ｙｏ)
)

(文語・キ
        (基本形)
        (体言接続)
        (命令ｅ)
)

(文語・ケリ
        (基本形)
        (体言接続)
)

(文語・リ
        (基本形)
        (体言接続)
)

(文語・ル
        (基本形)
        (未然形)
        (連用形)
        (体言接続)
        (仮定形)
        (命令ｅ)
        (命令ｙｏ)
)

(不変化型
        (基本形)
)



(形容詞・イイ
        (基本形)
        (基本形-促音便)
        (基本形-促音便)

)


(特殊・ドス
        (基本形)

)

(一段・得ル
        (基本形)
        (仮定形)
)


(特殊・ヤ
    (
        (基本形)
        (未然形)
        (連用形))
)
)
