pub mod *品詞* {
    pub mod *名詞* {
        pub mod *固有名詞* {
            pub mod *人名* {
                define_enum! {
                    pub enum #人名# features[3] {
                        "一般" => #一般#,
                        "姓" => #姓#,
                        "名" => #名#,
                    }
                }
            }
            pub use self::*人名*::#人名#;

            pub mod *地域* {
                define_enum! {
                    pub enum #地域# features[3] {
                        "一般" => #一般#,
                        "国" => #国#,
                    }
                }
            }
            pub use self::*地域*::#地域#;

            define_enum! {
                pub enum #固有名詞# features[2] {
                    "一般" => #一般#,
                    "人名" => #人名#(..),
                    "組織" => #組織#,
                    "地域" => #地域#(..),
                }
            }
        }
        pub use self::*固有名詞*::#固有名詞#;

        pub mod *代名詞* {
            define_enum! {
                pub enum #代名詞# features[2] {
                    "一般" => #一般#,
                    "縮約" => #縮約#,
                }
            }
        }
        pub use self::*代名詞*::#代名詞#;

        pub mod *非自立* {
            define_enum! {
                pub enum #非自立# features[2] {
                    "一般" => #一般#,
                    "副詞可能" => #副詞可能#,
                    "助動詞語幹" => #助動詞語幹#,
                    "形容動詞語幹" => #形容動詞語幹#,
                }
            }
        }
        pub use self::*非自立*::#非自立#;

        pub mod *特殊* {
            define_enum! {
                pub enum #特殊# features[2] {
                    "助動詞語幹" => #助動詞語幹#,
                }
            }
        }
        pub use self::*特殊*::#特殊#;

        pub mod *接尾* {
            define_enum! {
                pub enum #接尾# features[2] {
                    "一般" => #一般#,
                    "人名" => #人名#,
                    "地域" => #地域#,
                    "サ変接続" => #サ変接続#,
                    "助動詞語幹" => #助動詞語幹#,
                    "形容動詞語幹" => #形容動詞語幹#,
                    "副詞可能" => #副詞可能#,
                    "助数詞" => #助数詞#,
                    "特殊" => #特殊#,
                }
            }
        }
        pub use self::*接尾*::#接尾#;

        define_enum! {
            pub enum #名詞# features[1] {
                "一般" => #一般#,
                "固有名詞" => #固有名詞#(..),
                "代名詞" => #代名詞#(..),
                "副詞可能" => #副詞可能#,
                "サ変接続" => #サ変接続#,
                "形容動詞語幹" => #形容動詞語幹#,
                "数" => #数#,
                "非自立" => #非自立#(..),
                "特殊" => #特殊#(..),
                "接尾" => #接尾#(..),
                "接続詞的" => #接続詞的#,
                "動詞非自立的" => #動詞非自立的#,
                "引用文字列" => #引用文字列#,
                "ナイ形容詞語幹" => #ナイ形容詞語幹#,
            }
        }
    }
    pub use self::*名詞*::#名詞#;

    pub mod *接頭詞* {
        define_enum! {
            pub enum #接頭詞# features[1] {
                "名詞接続" => #名詞接続#,
                "動詞接続" => #動詞接続#,
                "形容詞接続" => #形容詞接続#,
                "数接続" => #数接続#,
            }
        }
    }
    pub use self::*接頭詞*::#接頭詞#;

    pub mod *動詞* {
        define_enum! {
            pub enum #動詞# features[1] {
                "自立" => #自立#,
                "非自立" => #非自立#,
                "接尾" => #接尾#,
            }
        }
    }
    pub use self::*動詞*::#動詞#;

    pub mod *形容詞* {
        define_enum! {
            pub enum #形容詞# features[1] {
                "自立" => #自立#,
                "非自立" => #非自立#,
                "接尾" => #接尾#,
            }
        }
    }
    pub use self::*形容詞*::#形容詞#;

    pub mod *副詞* {
        define_enum! {
            pub enum #副詞# features[1] {
                "一般" => #一般#,
                "助詞類接続" => #助詞類接続#,
            }
        }
    }
    pub use self::*副詞*::#副詞#;

    pub mod *助詞* {
        pub mod *格助詞* {
            define_enum! {
                pub enum #格助詞# features[2] {
                    "一般" => #一般#,
                    "引用" => #引用#,
                    "連語" => #連語#,
                }
            }
        }
        pub use self::*格助詞*::#格助詞#;

        define_enum! {
            pub enum #助詞# features[1] {
                "格助詞" => #格助詞#(..),
                "接続助詞" => #接続助詞#,
                "係助詞" => #係助詞#,
                "副助詞" => #副助詞#,
                "間投助詞" => #間投助詞#,
                "並立助詞" => #並立助詞#,
                "終助詞" => #終助詞#,
                "副助詞／並立助詞／終助詞" => #副助詞／並立助詞／終助詞#,
                "連体化" => #連体化#,
                "副詞化" => #副詞化#,
                "特殊" => #特殊#,
            }
        }
    }
    pub use self::*助詞*::#助詞#;

    pub mod *記号* {
        define_enum! {
            pub enum #記号# features[1] {
                "一般" => #一般#,
                "句点" => #句点#,
                "読点" => #読点#,
                "空白" => #空白#,
                "アルファベット" => #アルファベット#,
                "括弧開" => #括弧開#,
                "括弧閉" => #括弧閉#,
            }
        }
    }
    pub use self::*記号*::#記号#;

    pub mod *その他* {
        define_enum! {
            pub enum #その他# features[1] {
                "間投" => #間投#,
            }
        }
    }
    pub use self::*その他*::#その他#;

    define_enum! {
        pub enum #品詞# features[0] {
            "名詞" => #名詞#(..),
            "接頭詞" => #接頭詞#(..),
            "動詞" => #動詞#(..),
            "形容詞" => #形容詞#(..),
            "副詞" => #副詞#(..),
            "連体詞" => #連体詞#,
            "接続詞" => #接続詞#,
            "助詞" => #助詞#(..),
            "助動詞" => #助動詞#,
            "感動詞" => #感動詞#,
            "記号" => #記号#(..),
            "その他" => #その他#(..),
            "フィラー" => #フィラー#,
            "非言語音" => #非言語音#,
            "語断片" => #語断片#,
        }
    }
}
pub use self::*品詞*::#品詞#;

